Repository: JulianCCY/WLTF
Catalog: WLTF/Localizations/*.lproj/Localizable.strings
Languages: fi

source: menu
fi: valikosta

source: home
fi: jääkaappi

source: grocery
fi: ostoksilla

# normal_item
source: Normal items will be shown with this blue color.
fi: Normaalit kohteet näytetään tällä sinisellä värillä.

# 3_days_item
source: Color of items that will expire in 3 days.
fi: 3 päivän kuluttua vanhentuvien tuotteiden väri.

# 1_day_item
source: Color of items that will expire within 1 day.
fi: Tuotteen väri, joka vanhenee 1 päivän sisällä.

# expired_item
source: Color of items that are expired.
fi: Vanhentuneiden tuotteiden väri.

# add_button
source: Button for adding item to list.
fi: Painike kohteen lisäämiseksi luetteloon.

source: Gray colored
fi: Harmaa värinen

source: = input fields.
fi: = syöttökenttiä.

source: Home page
fi: Aloitusnäyttö

# closed_fridge
source: When fridge is closed
fi: Kun jääkaappi on kiinni

# sticky_note_number
source: Number of items that are expiring according to the color.
fi: Niiden tuotteiden määrä, jotka vanhenevat värin mukaan.

# tap_on_fridge
source: Tap on fridge to open your fridge.
fi: Napauta jääkaappia avataksesi jääkaapin.

# opened_fridge
source: When fridge is opened
fi: Kun jääkaappi avataan

# search_bar
source: Pull downwards to use search bar.
fi: Käytä hakupalkkia vetämällä alaspäin.

# click_to_add_food
source: Click on it to add food.
fi: Napsauta sitä lisätäksesi ruokaa.

# swipe_delete
source: Swipe left to delete item.
fi: Pyyhkäise vasemmalle poistaaksesi kohteen.

# hold_edit
source: Hold an item to edit it
fi: Pidä kohdetta painettuna muokataksesi sitä

source: Dish
fi: Astian näyttö

# represent_adequate
source: Represent adequate ingredients.
fi: Edustaa riittäviä ainesosia.

# represent_inadequate
source: Represent inadequate ingredients.
fi: Edustaa riittämättömiä ainesosia.

# click_create_dish
source: Click on it to create dish.
fi: Napsauta sitä luodaksesi ruokalajin.

# click_speech
source: Click on it to use speech recognition.
fi: Napsauta sitä käyttääksesi puheentunnistusta.

source: Back
fi: Takaisin

source: Settings
fi: Asetukset

# name_your_fridge
source: Name your fridge here!
fi: Nimeä jääkaappisi!

# general
source: General in WLTF
fi: Yleinen sisään WLTF

source: Amount
fi: Määrä

source: remaining
fi: jäljelle

source: Entry date
fi: Sisääntulopäivä

# expiry_date
source: Expiration date
fi: Päättymispäivä

source: consume
fi: kuluttaa

source: Consumed
fi: Kulutettu

source: Remove
fi: Poista

source: Added to list
fi: Lisätty listalle

source: Food name
fi: Ruoan nimi

# when_expire?
source: When will it expire?
fi: Milloin se vanhenee?

source: Empty name
fi: Tyhjä nimi

# amount_integer
source: Amount must be an integer
fi: Summan on oltava kokonaisluku

source: Invalid
fi: Virheellinen

source: Ok
fi: Okei

source: Name:
fi: Nimi:

source: Category:
fi: Kategoria:

source: Amount:
fi: Määrä:

source: Expiration:
fi: Vanheneminen:

# add_list_empty
source: The adding list is empty
fi: Lista on tyhjä

source: Confirm
fi: Vahvistaa

source: Grocery list
fi: Ostoslista

# description
source: Description (Optional)
fi: Kuvaus (Valinnainen)

source: Empty food name
fi: Ruokanimi tyhjä

source: TO-BUY (%lld)
fi: Ostaa (%lld)

# detected
source: Detected similar food remaining in fridge
fi: Jääkaapissa havaittiin samanlaista ruokaa jäljellä

# double_tab
source: Double tap to check your item
fi: Tarkista kohde kaksoisnapauttamalla

source: Note:
fi: Huomautus:

# blank
source: Black
fi: tyhjä

# empty_grocery_list?
source: Empty your grocery list?
fi: Tyhjentääkö ruokalistasi?

source: Yes please
fi: Kyllä ​​kiitos

source: Cancel
fi: Peruuttaa

# edit_item
source: Please input new food name and description
fi: Syötä uusi ruoan nimi ja kuvaus

# cook?
source: What to cook?
fi: Mitä kokata?

# no_dish
source: You do not have any dishes yet!
fi: Sinulla ei ole vielä ruokia!

# enough
source: Adequate ingredient
fi: Riittävä ainesosa

# not_enough
source: Inadequate ingredient
fi: Riittämätön ainesosa

# delete_all_dishes
source: Delete all of your dishes
fi: Poista kaikki ruokasi

# dish_name
source: Name of your dish
fi: Aterian nimi

source: Notes
fi: Huomautukset

source: Serving %lld people
fi: Palvelee %lld henkilöä

source: Ingredient
fi: Ainesosa

source: No ingredient
fi: Ei ainesosaa

# please_name_dish
source: Please name your dish
fi: Nimeä ruokasi

source: Portion:
fi: Annoksia:

source: %lld people
fi: %lld hengelle

source: Notes:
fi: Huomautus:

source: Ingredients
fi: Ainesosia

source: Delete
fi: Poistaa
